docs/history/history11/KBhPostRevolution.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-20 Wed 22:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Post Revolution</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Houjun Liu" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
<link rel="stylesheet" href="/admonition.css" type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Post Revolution</h1> <h2 class="subtitle"></h2> <span class="author">Houjun Liu</span> <span class="date">2021-10-20 Wed 22:11</date></div>
</div>
<div id="content">
<div id="linktables"><div id="table-of-backlinks"><h2>Backlinks</h2><ul><li><a class='backlink' href='KBhfed_vs_anti_ped_papers.html'>Fed vs Anti Ped Papers</a></li> <li><a class='backlink' href='KBhlatham_on_constitution.html'>Latham on Constitution</a></li> <li><a class='backlink' href='index.html'>HIST301 Master Index</a></li> </ul></div><div id="table-of-contents"><h2>Table of Contents</h2><div id="text-table-of-contents">
<ul>
<li><a href="#org8154ef9">1. The Articles of Confederation Sucked, so We Don't talk about it</a></li>
<li><a href="#org2b4617f">2. Writing the Constitution</a>
<ul>
<li><a href="#org86acef0">2.1. On Slavery</a></li>
<li><a href="#orgf263917">2.2. On States</a></li>
</ul>
</li>
<li><a href="#org4a732cb">3. The Plan of the Government</a>
<ul>
<li><a href="#org6477e66">3.1. We the People</a></li>
<li><a href="#orgebd74cd">3.2. Key Concepts of the Constitution</a>
<ul>
<li><a href="#org642b108">3.2.1. Three Branches</a></li>
<li><a href="#org81e956f">3.2.2. Checks and Balances</a></li>
<li><a href="#org9ab2b5e">3.2.3. Federalism</a></li>
<li><a href="#org91a8c7a">3.2.4. Changes and Amendments</a></li>
</ul>
</li>
<li><a href="#orgf821afd">3.3. Roles for the Branches of Government</a>
<ul>
<li><a href="#orgdd97a45">3.3.1. The Legislature</a></li>
<li><a href="#org71eb4d6">3.3.2. Executive Branch</a></li>
<li><a href="#org8253f73">3.3.3. Judicial</a></li>
</ul>
</li>
<li><a href="#org94d0a3e">3.4. Federalism</a>
<ul>
<li><a href="#org931721e">3.4.1. "Delegated Powers": National</a></li>
<li><a href="#orgdf2bb2d">3.4.2. "Concurrent Powers": Both</a></li>
<li><a href="#org0ef43bd">3.4.3. State Powers (TBD, didn't have time)</a></li>
</ul>
</li>
<li><a href="#orgfc8819f">3.5. Ratifying</a></li>
</ul>
</li>
<li><a href="#orgf41ef31">4. Readings about the constitution</a></li>
</ul>
</div></div>
</div>

<div id="outline-container-org8154ef9" class="outline-2">
<h2 id="org8154ef9"><span class="section-number-2">1</span> The Articles of Confederation Sucked, so We Don't talk about it</h2>
</div>

<div id="outline-container-org2b4617f" class="outline-2">
<h2 id="org2b4617f"><span class="section-number-2">2</span> Writing the Constitution</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>People are entrenched in their positions</li>
<li>There was a coordinating effort needed, and Washington provided final thoughts and synthesis.</li>
</ul>
</div>

<div id="outline-container-org86acef0" class="outline-3">
<h3 id="org86acef0"><span class="section-number-3">2.1</span> On Slavery</h3>
<div class="outline-text-3" id="text-2-1">
<p>
"The root of Evil is Greed" &#x2014; greed drove slavery. Hence, we need to be conscious of our greed: that people want to not have to work and for others to work for themselves.
</p>

<p>
Each generation shoves its problems down.
</p>
</div>
</div>

<div id="outline-container-orgf263917" class="outline-3">
<h3 id="orgf263917"><span class="section-number-3">2.2</span> On States</h3>
<div class="outline-text-3" id="text-2-2">
<p>
People identify with their states, not with the government. For instance, from the time up until the civil war, people still strongly identified with their states.
</p>

<blockquote>
<p>
I go where Virginia goes.
</p>
</blockquote>

<p>
&#x2014; Robert E. Lee
</p>

<p>
Therefore, people advocated strongly with state interests.
</p>
</div>
</div>
</div>

<div id="outline-container-org4a732cb" class="outline-2">
<h2 id="org4a732cb"><span class="section-number-2">3</span> The Plan of the Government</h2>
<div class="outline-text-2" id="text-3">
<p>
The Process of Crocheting a Government&#x2026;
</p>
</div>

<div id="outline-container-org6477e66" class="outline-3">
<h3 id="org6477e66"><span class="section-number-3">3.1</span> We the People</h3>
<div class="outline-text-3" id="text-3-1">
<p>
De-Identify with states, and to begin to think about all of the people (i.e. rich white men.) What changes through the constitution is {amendments, and <b><b>interpretations</b></b>}.
</p>

<p>
Interpretations are a system that evolve and change over time, to adapt old texts to new meaning.
</p>
</div>
</div>

<div id="outline-container-orgebd74cd" class="outline-3">
<h3 id="orgebd74cd"><span class="section-number-3">3.2</span> Key Concepts of the Constitution</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org642b108" class="outline-4">
<h4 id="org642b108"><span class="section-number-4">3.2.1</span> Three Branches</h4>
<div class="outline-text-4" id="text-3-2-1">
<ul class="org-ul">
<li>Legislative Branch: this should be the "more powerful" branch, it's article I</li>
<li>Executive Branch: job was to execute the laws that legislative branch put out there</li>
<li>Judicial Branch: very little thought of, but technically helps understand laws</li>
</ul>
</div>
</div>

<div id="outline-container-org81e956f" class="outline-4">
<h4 id="org81e956f"><span class="section-number-4">3.2.2</span> Checks and Balances</h4>
<div class="outline-text-4" id="text-3-2-2">
<ol class="org-ol">
<li>Legislative Branch comes up laws that checks executive branch</li>
<li>Judicial Branch interpreted law</li>
</ol>
</div>
</div>

<div id="outline-container-org9ab2b5e" class="outline-4">
<h4 id="org9ab2b5e"><span class="section-number-4">3.2.3</span> Federalism</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
"Federalism": certain powers can only be national government, some powers reserved for the states.
</p>
</div>

<ol class="org-ol">
<li><a id="orgbb06ba4"></a>National<br />
<div class="outline-text-5" id="text-3-2-3-1">
<ul class="org-ul">
<li>Foreign Affairs</li>
<li>Currency</li>
<li>Military</li>
</ul>
</div>
</li>

<li><a id="org6746d44"></a>State<br />
<div class="outline-text-5" id="text-3-2-3-2">
<ul class="org-ul">
<li>Education</li>
<li>Community (police, etc.)</li>
</ul>
</div>
</li>
</ol>
</div>

<div id="outline-container-org91a8c7a" class="outline-4">
<h4 id="org91a8c7a"><span class="section-number-4">3.2.4</span> Changes and Amendments</h4>
<div class="outline-text-4" id="text-3-2-4">
<ol class="org-ol">
<li>Change the constitution: amend it</li>
<li>Reinterpret the constitution: judge it</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgf821afd" class="outline-3">
<h3 id="orgf821afd"><span class="section-number-3">3.3</span> Roles for the Branches of Government</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The US government is intentionally inefficient.
</p>
</div>

<div id="outline-container-orgdd97a45" class="outline-4">
<h4 id="orgdd97a45"><span class="section-number-4">3.3.1</span> The Legislature</h4>
<div class="outline-text-4" id="text-3-3-1">
<ul class="org-ul">
<li>Congress controls budget</li>
<li>Congress has power to declare war: wanted people to not be able to blame one person for everything</li>
<li>Senate approves Ambassadors, Treaties and Justices
<ul class="org-ul">
<li>Senate has checks on executive branch</li>
<li>Senate is considered more powerful</li>
</ul></li>
<li>Congress can impeach presidents</li>

<li>Power over judicial: confirms nominations &amp; could impeach judges</li>
<li>Power over executive: approves nominations and and controls the budgets. Could override the Presidents's vetos and remove a president from office</li>
</ul>
</div>
</div>

<div id="outline-container-org71eb4d6" class="outline-4">
<h4 id="org71eb4d6"><span class="section-number-4">3.3.2</span> Executive Branch</h4>
<div class="outline-text-4" id="text-3-3-2">
<ul class="org-ul">
<li>Could propose laws and suggest budgets to the house, who will put it into a vote</li>
<li>Did not want tyranny of one person controlling to the military</li>
<li>Commander in Chief still centralized to make war-making efficient</li>
<li>Appoints ambassadors and justices</li>

<li>Power over judicial: could appoint judges</li>
<li>Power over legislative: could veto laws</li>
</ul>
</div>
</div>

<div id="outline-container-org8253f73" class="outline-4">
<h4 id="org8253f73"><span class="section-number-4">3.3.3</span> Judicial</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
Nominated by presidents and interpret laws could change the interpretation of laws.
</p>

<p>
Checks and balances figure balances figure
</p>

<ul class="org-ul">
<li>Power over executive: could declare presidential acts unconstitutional</li>
<li>Power over legislative: could declare laws unconstitutional</li>
</ul>
</div>

<ol class="org-ol">
<li><a id="orgbf2906f"></a>Laws vs. Amendments<br />
<div class="outline-text-5" id="text-3-3-3-1">
<p>
Amending the constitution takes an enormous super-majority. States must ratify the amendments. Laws are changed by various interpretation by the judicial branches.
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org94d0a3e" class="outline-3">
<h3 id="org94d0a3e"><span class="section-number-3">3.4</span> Federalism</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Pro national government. Against Anti-Federalists, who advocated strong state rights and didn't want national layer.
</p>
</div>

<div id="outline-container-org931721e" class="outline-4">
<h4 id="org931721e"><span class="section-number-4">3.4.1</span> "Delegated Powers": National</h4>
<div class="outline-text-4" id="text-3-4-1">
<ul class="org-ul">
<li>Declare war</li>
<li>Negotiate treaties</li>
<li>Issue money</li>
<li>Regulate interstate &amp; foreign trade</li>
<li>Military forces</li>
</ul>
</div>
</div>

<div id="outline-container-orgdf2bb2d" class="outline-4">
<h4 id="orgdf2bb2d"><span class="section-number-4">3.4.2</span> "Concurrent Powers": Both</h4>
<div class="outline-text-4" id="text-3-4-2">
<ul class="org-ul">
<li>Levy taxes</li>
<li>Define <b>crimes</b> and their punishments</li>
<li>Determine voting qualifications: yes, states actually decide</li>
<li>Borrow money</li>
</ul>
</div>
</div>

<div id="outline-container-org0ef43bd" class="outline-4">
<h4 id="org0ef43bd"><span class="section-number-4">3.4.3</span> State Powers (TBD, didn't have time)</h4>
<div class="outline-text-4" id="text-3-4-3">
<ul class="org-ul">
<li>Education and society</li>
<li>Societal governance</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfc8819f" class="outline-3">
<h3 id="orgfc8819f"><span class="section-number-3">3.5</span> Ratifying</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>Constitution was only ratified as a promise of the Bill of Rights were made</li>
<li>The Amendment process allows for adjustments to the plan of government over time</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf41ef31" class="outline-2">
<h2 id="orgf41ef31"><span class="section-number-2">4</span> Readings about the constitution</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Latham Constitution: <a href="../../../src/history/history11/KBhlatham_on_constitution.html#ID-088740EE-5FB9-47D7-8095-1F0F92778C9F">Latham on Constitution</a></li>
<li>Fed vs Anti Fed: <a href="../../../src/history/history11/KBhfed_vs_anti_ped_papers.html#ID-34F564F9-251F-4D1E-A651-B5C47D7B9066">Fed vs Anti Ped Papers</a></li>
</ul>

<p>
<b>Reflection</b>
</p>

<ol class="org-ol">
<li>I believe that Dickinson would have a fairly positive response to the Constitution (which, demonstrably, he did.) Having been an usually moderate framer, Dickinson's chief concerns surrounds that of the representation that a small state Delaware gets in the larger federal government. The Connecticut compromise &#x2014; a bicameral plan for the legislature &#x2014; was successfully introduced into the Constitution, which in kind signifies the rhetorical success of Dickinson. Although he did not achieve the full halt of the slave trade as he wished, Dickinson nevertheless supported the passage of the constitution and thought of the slave trade as a side agitation that could be addressed later.</li>
<li>I agree that absolute democracy, as Latham highlighted, cannot practically be achieved while respecting the conflicting wishes of all classes (i.e. respecting freedom vs. regulating security/trade, etc.) &#x2014; paradoxically preventing the "democratic" resolution that respects the opinions of both. However, I don't necessarily agree with the frame of the ratification of the constitution as a light coup d'etat. The chaotic start of the United States signifies the exploration of a sense of unknown, and not necessarily a systemic failure. The Constitution simply takes the unreconcilable issues with the previous system in perspective and syntheses a largely-improved program that, while respecting the democratic ideals of the original declaration, revises the terms of union to actually be practical.</li>
<li>Being in and reaping the benefits of the federalist system in the United States, I have a very biased lens with respect to how an anti-federalist society would result. What I found very interesting about Federalist Paper 10, however, is its claim that a larger and purely-democratic society is susceptible to functioning. In the current American system, some degree factioning may actually help expedite the deadlock to which the Federalist-driven two-party system has granted. I nevertheless fully agree with the idea that Federalism perhaps increases central executor space and allows the protection of minority opinions. Hence, although a combination of Federalism with a degree of freedom maybe helpful for the American landscape, the current system is likely one of the best to maintain governmental function.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
